МойДипломРабочаяВерсия/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

МойДипломРабочаяВерсия/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
      <types>DocumentRef.ВКМ_ОбслуживаниеКлиентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

МойДипломРабочаяВерсия/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачалаАбонентскогоОбслуживания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончанияАбонентскогоОбслуживания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

МойДипломРабочаяВерсия/src/CommonModules/ВКМ_ЗаполнениеДокументов/Module.bsl
#Область ПрограммныйИнтерфейс
Процедура ЗаполнитьДокументы(Параметры, АдресРезультата) Экспорт 
	
	Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |   ДоговорыКонтрагентов.Ссылка,
    |   ДоговорыКонтрагентов.Наименование,
    |   ДоговорыКонтрагентов.Организация,
    |   ДоговорыКонтрагентов.Владелец
    |ИЗ
    |   Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
    |ГДЕ
    |   НЕ ДоговорыКонтрагентов.ПометкаУдаления
    |   И ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
    |   И ДоговорыКонтрагентов.ВКМ_ДатаНачалаАбонентскогоОбслуживания <= &ДатаНачала";
    
    Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);  
    Запрос.УстановитьПараметр("ДатаНачала", НачалоМесяца(Параметры.Период));
    
    ТаблицаДоговоров = Запрос.Выполнить().Выгрузить();
	
	МассивДоговоров = Новый Массив;
    Для Каждого СтрокаДоговора Из ТаблицаДоговоров Цикл
        МассивДоговоров.Добавить(СтрокаДоговора.Наименование);
    КонецЦикла;
    
    ЗапросРеализаций = Новый Запрос;
    ЗапросРеализаций.Текст = 
    "ВЫБРАТЬ
    |   РеализацияТоваровУслуг.Договор.Наименование КАК НаименованиеДоговора
    |ИЗ
    |   Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
    |ГДЕ
    |   РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
    |   И РеализацияТоваровУслуг.Договор.ВидДоговора = &ВидДоговора
    |   И РеализацияТоваровУслуг.Договор.Наименование В (&МассивДоговоров)
    |   И НЕ РеализацияТоваровУслуг.ПометкаУдаления
    |СГРУППИРОВАТЬ ПО
    |   РеализацияТоваровУслуг.Договор.Наименование";
    
    ЗапросРеализаций.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);
    ЗапросРеализаций.УстановитьПараметр("ДатаНачала", НачалоМесяца(Параметры.Период));
    ЗапросРеализаций.УстановитьПараметр("ДатаОкончания", КонецМесяца(Параметры.Период));
    ЗапросРеализаций.УстановитьПараметр("МассивДоговоров", МассивДоговоров);
    
    ДоговорыСРеализациями = Новый Соответствие;
    ТаблицаРеализаций = ЗапросРеализаций.Выполнить().Выгрузить();
    Для Каждого СтрокаРеализации Из ТаблицаРеализаций Цикл
        ДоговорыСРеализациями[СтрокаРеализации.НаименованиеДоговора] = Истина;
    КонецЦикла;
    
    Для Каждого СтрокаДоговора Из ТаблицаДоговоров Цикл
        Если ДоговорыСРеализациями.Получить(СтрокаДоговора.Наименование) = Неопределено Тогда
            ДокументОбъект = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
            ДокументОбъект.Дата = КонецМесяца(Параметры.Период);
            ДокументОбъект.Организация = СтрокаДоговора.Организация;
            ДокументОбъект.Контрагент = СтрокаДоговора.Владелец;
            ДокументОбъект.Договор = СтрокаДоговора.Ссылка;
            ДокументОбъект.Основание = СтрокаДоговора.Ссылка;
            ДокументОбъект.Комментарий = "Создан обработкой ""Массовое создание документов""";
            ДокументОбъект.Ответственный = Пользователи.ТекущийПользователь();
            ДокументОбъект.ВыполнитьАвтозаполнение();
            ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
        КонецЕсли;
    КонецЦикла;	
КонецПроцедуры
#КонецОбласти
